---
kind: type
id: T:Autodesk.Revit.DB.FilterableValueProvider
source: html/50829fa2-03f1-9d4b-a3cd-2935d3bf8a8c.htm
---
# Autodesk.Revit.DB.FilterableValueProvider

Defines the interface for classes that extract values from elements
 in a Revit project for testing against filter rules.

## Syntax (C#)
```csharp
public class FilterableValueProvider : IDisposable
```